OpenFOAM-11/tutorials/multiRegion/film/VoFToFilm/0/VoF/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    film
    {
        type            fixedFluxPressure;
    }

    bottom
    {
        type            fixedFluxPressure;
    }

    atmosphere
    {
        type            prghTotalPressure;
        p0              $internalField;
    }

    #includeEtc "caseDicts/setConstraintTypes"
}

// ************************************************************************* //
